mischief/nlos/src/platform/esp32/drivers.c
static const luaL_Reg flash_lib[] = {
	{ "capacity", flash_capacity },
	{ "read", flash_read },
	{ "write", flash_write },
	{ NULL, NULL },
};

/* one volume's three calls, plus maxsec: the shape lib/blkfs.lua takes
 * as a device, so a caller hands it this and the filesystem above never
 * learns which partition it sits on.
 */
static void
pushvolume(lua_State *L, int vol)
{
	const luaL_Reg *f;

	lua_createtable(L, 0, 4);
	for (f = flash_lib; f->name != NULL; f++) {
		lua_pushinteger(L, vol);
		lua_pushcclosure(L, f->func, 1);
		lua_setfield(L, -2, f->name);
	}
	lua_pushinteger(L, ESP_FLASHBLK_MAXSEC);
	lua_setfield(L, -2, "maxsec");
	lua_pushinteger(L, vol + 1);
	lua_setfield(L, -2, "index");	/* which one this is, for a name */
}

/* flash.volume(i) -> a device table, or nil where the partition table
 * has no such partition. 1-based, as every other index a lua caller
 * gives.
 */
static int
flash_volume(lua_State *L)
{
	lua_Integer i = luaL_checkinteger(L, 1);

	if (i < 1 || i > ESP_FLASHBLK_NVOL || !esp_flashblk_present((int)i - 1))
		return 0;
	pushvolume(L, (int)i - 1);
	return 1;
}

/* how many of them this board actually has. A partition table without
 * config answers 1, and the caller serves what is there.
 */
static int
flash_count(lua_State *L)
{
	int n = 0;

	while (n < ESP_FLASHBLK_NVOL && esp_flashblk_present(n))
		n++;
	lua_pushinteger(L, n);
	return 1;
}

int luaopen_los_platform_flash(lua_State *L);

int
luaopen_los_platform_flash(lua_State *L)
{
	/* the module IS volume 1, so a caller holding it reaches luafs
	 * with the same three calls los.platform.blk gives.
	 */
	pushvolume(L, 0);
	lua_pushcfunction(L, flash_volume);
	lua_setfield(L, -2, "volume");
	lua_pushcfunction(L, flash_count);
	lua_setfield(L, -2, "count");
	return 1;
}

/* ---- los.platform.fb: the ST7789, as rectangles ----
 *
 * The same surface efi's GOP backend gives, minus unload: reading
 * pixels back would need either a shadow framebuffer (64800 bytes on a
 * board with none to spare) or ST7789 readback over SPI, which is not
 * reliable. It reports that rather than returning a plausible lie --
 * fb.lua's clients get {err=}, and a layer that needs to save what a
 * window covers will have to keep its own copy.
 */

static void
checkrect(lua_State *L, lua_Integer x, lua_Integer y, lua_Integer w,
    lua_Integer h)
{
	if (x < 0 || y < 0 || w < 0 || h < 0)
		luaL_error(L, "negative rectangle");
	if (x + w > luaos_lcd_width() || y + h > luaos_lcd_height())
		luaL_error(L, "rectangle %dx%d at %d,%d is off a %dx%d screen",
		    (int)w, (int)h, (int)x, (int)y,
		    luaos_lcd_width(), luaos_lcd_height());
}

static void
pushmode(lua_State *L)
{
	lua_createtable(L, 0, 4);
	lua_pushinteger(L, 0);
	lua_setfield(L, -2, "n");
	lua_pushinteger(L, luaos_lcd_width());
	lua_setfield(L, -2, "w");
	lua_pushinteger(L, luaos_lcd_height());
	lua_setfield(L, -2, "h");
	/* the panel's own, which load() now takes without converting.
	 * bgrx is still accepted, so a client written against efi works
	 * here unchanged -- it just pays the conversion lcd.c does.
	 */
	lua_pushstring(L, "r5g6b5");
	lua_setfield(L, -2, "format");
}

static int
fb_modes(lua_State *L)
{
	lua_createtable(L, 1, 0);
	pushmode(L);
	lua_rawseti(L, -2, 1);
	return 1;
}

static int
fb_mode(lua_State *L)
{
	pushmode(L);
	return 1;
}

/* one fixed mode: the panel is 240x135 and has no others. */
static int
fb_setmode(lua_State *L)
{
	if (luaL_checkinteger(L, 1) != 0)
		return luaL_error(L, "no such mode");
	return 0;
}

static int
fb_fill(lua_State *L)
{
	lua_Integer x = luaL_checkinteger(L, 1);
	lua_Integer y = luaL_checkinteger(L, 2);
	lua_Integer w = luaL_checkinteger(L, 3);
	lua_Integer h = luaL_checkinteger(L, 4);
	lua_Unsigned c = (lua_Unsigned)luaL_checkinteger(L, 5);

	checkrect(L, x, y, w, h);
	if (w == 0 || h == 0)
		return 0;
	if (luaos_lcd_fill((int)x, (int)y, (int)w, (int)h, (uint32_t)c) != 0)
		return luaL_error(L, "fill failed");
	return 0;
}

static int
fb_load(lua_State *L)
{
	lua_Integer x = luaL_checkinteger(L, 1);
	lua_Integer y = luaL_checkinteger(L, 2);
	lua_Integer w = luaL_checkinteger(L, 3);
	lua_Integer h = luaL_checkinteger(L, 4);
	size_t n;
	const char *pix = luabuf_check(L, 5, &n);
	const char *fmt = luaL_optstring(L, 6, "bgrx");
	int wide = strcmp(fmt, "r5g6b5") == 0;
	size_t need = (size_t)w * (size_t)h * (wide ? 2 : 4);

	if (!wide && strcmp(fmt, "bgrx") != 0)
		return luaL_error(L, "fb.load: no such format: %s", fmt);
	checkrect(L, x, y, w, h);
	if (n != need)
		return luaL_error(L, "want %d bytes for %dx%d %s, got %d",
		    (int)need, (int)w, (int)h, fmt, (int)n);
	if (need == 0)
		return 0;
	/* r5g6b5 is what the panel takes, so it goes straight down */
	if (wide) {
		if (luaos_lcd_load16((int)x, (int)y, (int)w, (int)h,
		    (const unsigned char *)pix) != 0)
			return luaL_error(L, "load failed");
		return 0;
	}
	if (luaos_lcd_load((int)x, (int)y, (int)w, (int)h,
	    (const unsigned char *)pix) != 0)
		return luaL_error(L, "load failed");
	return 0;
}

/* fb.unload(x,y,w,h [, fmt]) -> the pixels.
 *
 * "bgrx" by default, which is the shared fb protocol's layout and what
 * every drawing client reads. "rgb" is the same pixels with no pad, for
 * a caller writing a file: see luaos_lcd_unload_rgb.
 */
static int
fb_unload(lua_State *L)
{
	lua_Integer x = luaL_checkinteger(L, 1);
	lua_Integer y = luaL_checkinteger(L, 2);
	lua_Integer w = luaL_checkinteger(L, 3);
	lua_Integer h = luaL_checkinteger(L, 4);
	const char *fmt = luaL_optstring(L, 5, "bgrx");
	int rgb = strcmp(fmt, "rgb") == 0;
	size_t need = (size_t)w * (size_t)h * (rgb ? 3 : 4);
	luaL_Buffer b;
	char *out;
	int rc;

	if (!rgb && strcmp(fmt, "bgrx") != 0)
		return luaL_error(L, "fb.unload: no such format: %s", fmt);
	checkrect(L, x, y, w, h);
	if (need == 0) {
		lua_pushliteral(L, "");
		return 1;
	}
	out = luaL_buffinitsize(L, &b, need);
	rc = rgb ? luaos_lcd_unload_rgb((int)x, (int)y, (int)w, (int)h,
	    (unsigned char *)out)
	    : luaos_lcd_unload((int)x, (int)y, (int)w, (int)h,
	    (unsigned char *)out);
	if (rc != 0)
		return luaL_error(L, "fb.unload: no copy kept -- "
		    "this panel cannot be read, call fb.shadow(true) first");
	luaL_pushresultsize(&b, need);
	return 1;
}


static int
fb_scroll(lua_State *L)
{
	lua_Integer x = luaL_checkinteger(L, 1);
	lua_Integer y = luaL_checkinteger(L, 2);
	lua_Integer tox = luaL_checkinteger(L, 3);
	lua_Integer toy = luaL_checkinteger(L, 4);
	lua_Integer w = luaL_checkinteger(L, 5);
	lua_Integer h = luaL_checkinteger(L, 6);

